1,使用记事本写js可能会有什么问题。

2，写出你平时打开浏览器开发者工具的姿势。（比如设置=>开发者工具)

3.js注释有哪几种方式，哪种绝对安全。

4.谈谈你对'js支持utf-8'编码的理解。

5.举个例子表示在字符串中写有双引号情况

6. 0.1+0.2 === 0.3 ?

7. "" == false ? 你认为结果客观逻辑是否合理。

8. 有个css代码
    .student {
    width: 20px;
    background-color: red;
}
把上面代码写成一个对象的形式，
并写出你调用background-color的方式（用代码表示)

9. 如何使用js严格模式，能不能在函数内部声明严格模式?

10.如果在htm里面使用外部js，你认为script标签放在html哪个位置比较合适。

11. var author = ''  // 写你自己大名
使用模板字符串写一首静夜诗，里面的插入author变量。

12. 写出你所能想到的拷贝一个字符串的方法

13.不使用splice方法，从数组[1, 3, -5, 9, 55]中删除9。

14.有个数组arr，里面有100000个字符串，现在要把这个数组里面所有字符串拼成一个字符串，你认为使用循环的方式用+拼接效率高，还是用数组的join函数拼接的方式效率高。



